1. Откройте JetBrains IDE, в которой нужно сбросить триальный период
2. Установите плагин одним из способов

  2.1.1 Перейти в Preferences -> Plugins
  2.1.2 Нажать на шестеренку и в выпадающем списке нажать на "Manage Plugin Repositories..."
  2.1.3 Добавить в список адрес https://plugins.zhile.io и нажать ОК
  2.1.4 Во вкладке Marketplace в поиске ввести "IDE Eval Reset" без кавычек и установить соответствующий плагин
  2.1.5 Перезапустить IDE

ИЛИ

  2.2.1 Скачать образ по ссылке > и смонтировать его
  2.2.2 Распаковать архив "ide-eval-resetter-2.2.4-4959c6.zip" и достать из него .jar файл
  2.2.3 Перейти в Preferences -> Plugins нужной вам JetBrains IDE
  2.2.4 Нажать на иконку шестеренки и в выпадающем списке нажать на "Install Plugin from Disk..."
  2.2.5 Выбрать файл ide-eval-resetter-2.2.4.jar
  2.2.6 Перезапустить IDE

ИЛИ

  2.3.1 Скачать образ по ссылке > и смонтировать его
  2.3.2 Архив "ide-eval-resetter-2.2.4-4959c6.zip" перетянуть в любое открытое окно IDE
  2.3.3 Перезапустить IDE

3. Открыть существующий или создать новый проект
4. Перейти в меню Help и нажать на пункт "Eval Reset"
5. В появившейся снизу панели нажать кнопку "Reset"
6. После перезапуска IDE активировать Trial период на 30 дней